(λ t . (λ m n . n (λ n f x . n f (f x)) m) ((λ n . (λ m n f . m (n f)) n n) ((λ n . (λ m n f . m (n f)) n n) t)) ((λ n . (λ m n f . m (n f)) n n) t)) ((λ m n . n (λ n f x . n f (f x)) m) ((λ m n f . m (n f)) (λ f x . x) ((λ m n . n (λ n f x . n f (f x)) m) ((λ n f x . n f (f x)) (λ f x . x)) ((λ n f x . n f (f x)) (λ f x . x)))) ((λ n f x . n f (f x)) ((λ n f x . n f (f x)) (λ f x . x))))

alpha - ((((λt.((λm.(λn.n))(((λa.(λf.(λx.a)))f)(f x))))m))((((λb.((λc.(λd.(λe.c)))(b f)))n)n)((((λg.((λh.(λi(λj.h)))(g f)))n)n)t))(((λk.((λl.(λo.(λp.l)))(k f)))n)n)t))(((((λq.(λr.r))(((λs.(λu.(λv.s)))f)(f x)))m)((((λw.(λy.(λz.w)))(n f))(λa1.(λb1.b1)))(((((λc1.(λd1.d1))(((λe1.(λg1.(λh1.e1)))f)(f x)))m)((((λi1.(λj1.(λk1.i)))f)(f x))(λl1.(λo1.o1))))((((λp1.(λq1.(λr1.p1)))f)(f x))(λs1.(λu1.u))))))((((λv1.(λw1.(λy1.v1)))f)(f x))((((λz1.(λa2.(λb2.z1)))f)(f x))(λc2.(λd2.d2))))))

beta - (((((λm.(λn.n))(((λa.(λf.(λx.a)))a)(b c)))d)((((λk.((λl.(λo.(λp.l)))(k o)))p)q)r))(((((λq.(λr.r))(((λs.(λu.(λv.s)))s)(u v)))w)((((λw.(λy.(λz.w)))(y z))(λa1.(λb1.b1)))(((((λc1.(λd1.d1))(((λe1.(λg1.(λh1.e1)))a1)(b1 c1)))d1)((((λi1.(λj1.(λk1.i1)))e1)(g1 h1))(λl1.(λo1.o1))))((((λp1.(λq1.(λr1.p1)))i1)(j1 k1))(λs1.(λu1.u1))))))((((λv1.(λw1.(λy1.v1)))l1)(o1 p1))((((λz1.(λa2.(λb2.z1)))q1)(r1 s1))(λc2.(λd2.d2))))))

beta - ((((λn.n)d)((((λk.((λl.(λo.(λp.l)))(k o)))p)q)r))(((((λq.(λr.r))(((λs.(λu.(λv.s)))s)(u v)))w)((((λw.(λy.(λz.w)))(y z))(λa1.(λb1.b1)))(((((λc1.(λd1.d1))(((λe1.(λg1.(λh1.e1)))a1)(b1 c1)))d1)((((λi1.(λj1.(λk1.i1)))e1)(g1 h1))(λl1.(λo1.o1))))((((λp1.(λq1.(λr1.p1)))i1)(j1 k1))(λs1.(λu1.u1))))))((((λv1.(λw1.(λy1.v1)))l1)(o1 p1))((((λz1.(λa2.(λb2.z1)))q1)(r1 s1))(λc2.(λd2.d2))))))

beta - ((d((((λk.((λl.(λo.(λp.l)))(k o)))p)q)r))(((((λq.(λr.r))(((λs.(λu.(λv.s)))s)(u v)))w)((((λw.(λy.(λz.w)))(y z))(λa1.(λb1.b1)))(((((λc1.(λd1.d1))(((λe1.(λg1.(λh1.e1)))a1)(b1 c1)))d1)((((λi1.(λj1.(λk1.i1)))e1)(g1 h1))(λl1.(λo1.o1))))((((λp1.(λq1.(λr1.p1)))i1)(j1 k1))(λs1.(λu1.u1))))))((((λv1.(λw1.(λy1.v1)))l1)(o1 p1))((((λz1.(λa2.(λb2.z1)))q1)(r1 s1))(λc2.(λd2.d2))))))

beta - ((d((((λl.(λo.(λp.l)))(p o))q)r))(((((λq.(λr.r))(((λs.(λu.(λv.s)))s)(u v)))w)((((λw.(λy.(λz.w)))(y z))(λa1.(λb1.b1)))(((((λc1.(λd1.d1))(((λe1.(λg1.(λh1.e1)))a)(b1 c1)))d1)((((λi1.(λj1.(λk1.i1)))e1)(g1 h1))(λl1.(λo1.o1))))((((λp1.(λq1.(λr1.p1)))i1)(j1 k1))(λs1.(λu1.u1))))))((((λv1.(λw1.(λy1.v1)))l1)(o1 p1))((((λz1.(λa2.(λb2.z1)))q1)(r1 s1))(λc2.(λd2.d2))))))

beta - ((d(((λo.(λp.(p o)))q)r))(((((λq.(λr.r))(((λs.(λu.(λv.s)))s)(u v)))w)((((λw.(λy.(λz.w)))(y z))(λa1.(λb1.b1)))(((((λc1.(λd1.d1))(((λe1.(λg1.(λh1.e1)))a1)(b1 c1)))d1)((((λi1.(λj1.(λk1.i1)))e1)(g1 h1))(λl1.(λo1.o1))))((((λp1.(λq1.(λr1.p1)))i1)(j1 k1))(λs1.(λu1.u1))))))((((λv1.(λw1.(λy1.v1)))l1)(o1 p1))((((λz1.(λa2.(λb2.z2)))q1)(r1 s1))(λc2.(λd2.d2))))))

beta - ((d((λp.(p o))r))(((((λq.(λr.r))(((λs.(λu.(λv.s)))s)(u v)))w)((((λw.(λy.(λz.w)))(y z))(λa1.(λb1.b1)))(((((λc1.(λd1.d1))(((λe1.(λg1.(λh1.e1)))a1)(b1 c1)))d1)((((λi1.(λj1.(λk1.i1)))e1)(g1 h1))(λl1.(λo1.o1))))((((λp1.(λq1.(λr1.p1)))i1)(j1 k1))(λs1.(λu1.u1))))))((((λv1.(λw1.(λy1.v1)))l1)(o1 p1))((((λz1.(λa2.(λb2.z2)))q1)(r1 s1))(λc2.(λd2.d2))))))

beta - ((d(p o))(((((λq.(λr.r))(((λs.(λu.(λv.s)))s)(u v)))w)((((λw.(λy.(λz.w)))(y z))(λa1.(λb1.b1)))(((((λc1.(λd1.d1))(((λe1.(λg1.(λh1.e1)))a1)(b1 c1)))d1)((((λi1.(λj1.(λk1.i1)))e1)(g1 h1))(λl1.(λo1.o1))))((((λp1.(λq1.(λr1.p1)))i1)(j1 k1))(λs1.(λu1.u1))))))((((λv1.(λw1.(λy1.v1)))l1)(o1 p1))((((λz1.(λa2.(λb2.z2)))q1)(r1 s1))(λc2.(λd2.d2))))))

beta - ((d(p o))((((λr.r)w)((((λw.(λy.(λz.w)))(y z))(λa1.(λb1.b1)))(((((λc1.(λd1.d1))(((λe1.(λg1.(λh1.e1)))a1)(b1 c1)))d1)((((λi1.(λj1.(λk1.i1)))e1)(g1 h1))(λl1.(λo1.o1))))((((λp1.(λq1.(λr1.p1)))i1)(j1 k1))(λs1.(λu1.u1))))))((((λv1.(λw1.(λy1.v1)))l1)(o1 p1))((((λz1.(λa2.(λb2.z2)))q1)(r1 s1))(λc2.(λd2.d2))))))

beta - ((d(p o))((w((((λw.(λy.(λz.w)))(y z))(λa1.(λb1.b1)))(((((λc1.(λd1.d1))(((λe1.(λg1.(λh1.e1)))a1)(b1 c1)))d1)((((λi1.(λj1.(λk1.i1)))e1)(g1 h1))(λl1.(λo1.o1))))((((λp1.(λq1.(λr1.p1)))i1)(j1 k1))(λs1.(λu1.u1))))))((((λv1.(λw1.(λy1.v1)))l1)(o1 p1))((((λz1.(λa2.(λb2.z2)))q1)(r1 s1))(λc2.(λd2.d2))))))

beta - ((d(p o))((w(((λy.(λz.(y z)))(λa1.(λb1.b1)))(((((λc1.(λd1.d1))(((λe1.(λg1.(λh1.e1)))a1)(b1 c1)))d1)((((λi1.(λj1.(λk1.i1)))e1)(g1 h1))(λl1.(λo1.o1))))((((λp1.(λq1.(λr1.p1)))i1)(j1 k1))(λs1.(λu1.u1))))))((((λv1.(λw1.(λy1.v1)))l1)(o1 p1))((((λz1.(λa2.(λb2.z2)))q1)(r1 s1))(λc2.(λd2.d2))))))

beta - ((d(p o))((w((λz.(y z))(((((λc1.(λd1.d1))(((λe1.(λg1.(λh1.e1)))a1)(b1 c1)))d1)((((λi1.(λj1.(λk1.i1)))e1)(g1 h1))(λl1.(λo1.o1))))((((λp1.(λq1.(λr1.p1)))i1)(j1 k1))(λs1.(λu1.u1))))))((((λv1.(λw1.(λy1.v1)))l1)(o1 p1))((((λz1.(λa2.(λb2.z2)))q1)(r1 s1))(λc2.(λd2.d2))))))

beta - ((d(p o))((w(y z))((((λv1.(λw1.(λy1.v1)))l1)(o1 p1))((((λz1.(λa2.(λb2.z2)))q1)(r1 s1))(λc2.(λd2.d2))))))

beta - ((d(p o))((w(y z))(((λw1.(λy1.l1))(o1 p1))((((λz1.(λa2.(λb2.z2)))q1)(r1 s1))(λc2.(λd2.d2))))))

beta - ((d(p o))((w(y z))((λy1.l1)((((λz1.(λa2.(λb2.z2)))q1)(r1 s1))(λc2.(λd2.d2))))))

beta - ((d(p o))((w(y z))l1))

